<a href="https://colab.research.google.com/github/alphoenixbiz/Machine-Learning-Using-Python/blob/master/Decision%20Tree/Example%200/Decision_Tree_example0.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt
%matplotlib inline

In [0]:
from google.colab import drive 
drive.mount('/content/gdrive')

In [93]:
df = pd.read_csv("gdrive/My Drive/Colab Notebooks/DATA/titanic.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [95]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [0]:
from sklearn.preprocessing import LabelEncoder
le_sex = LabelEncoder()

In [0]:
df['Sex_n'] = le_sex.fit_transform(df['Sex'])

Another way:

In [0]:
#df.Sex = df.Sex.map({'male': 1, 'female': 2})

In [99]:
df.head()

   Survived  Pclass     Sex   Age     Fare  Sex_n
0         0       3    male  22.0   7.2500      1
1         1       1  female  38.0  71.2833      0
2         1       3  female  26.0   7.9250      0
3         1       1  female  35.0  53.1000      0
4         0       3    male  35.0   8.0500      1

In [0]:
#Remove NaN
df.Age = df.Age.fillna(df.Age.mean())

In [101]:
df.drop(['Sex'],axis='columns',inplace=True)
df.head()

   Survived  Pclass   Age     Fare  Sex_n
0         0       3  22.0   7.2500      1
1         1       1  38.0  71.2833      0
2         1       3  26.0   7.9250      0
3         1       1  35.0  53.1000      0
4         0       3  35.0   8.0500      1

In [0]:
X = df.drop(['Survived'],axis='columns')
y = df.Survived

In [0]:
X = X.values
y = y.values

In [0]:
from sklearn.tree import DecisionTreeClassifier
tree_model = DecisionTreeClassifier()

In [0]:
tree_model.fit(X, y)

In [106]:
tree_model.score(X,y)

0.9797979797979798

In [108]:
tree_model.predict([[2,1,1,8]])

array([1])